---
type: StructuralSectionUserDefined
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionUserDefined

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUserDefined` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionUserDefined | 2016 | `public StructuralSectionUserDefined ( double width , double height , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeight , double` |